# Brewfile — generated for Mike's MacBook Pro
# Usage: brew bundle install --file=~/.dotfiles/Brewfile

# ── Core CLI tools ────────────────────────────────────────────────────────────
brew "git"
brew "curl"
brew "wget"
brew "gh"

# ── Shell ─────────────────────────────────────────────────────────────────────
brew "starship"

# ── Node / JS ─────────────────────────────────────────────────────────────────
# nvm is installed via curl script, not Homebrew
brew "pnpm"

# ── Python ────────────────────────────────────────────────────────────────────
brew "pyenv"

# ── Apps ──────────────────────────────────────────────────────────────────────
cask "1password"
cask "claude"
cask "cursor"
cask "ghostty"
cask "google-chrome"
cask "spotify"
cask "visual-studio-code"
cask "whatsapp"
cask "zed"
